{
  "local": {
    "displayName": "xiaoyu zhou",
    "last_name": "zhou",
    "first_name": "xiaoyu",
    "email": "xiaoyuz2011@gmail.com",
    "avatar": "./avatar/user.png"
  },
  "personality_assessement": {
    "last_upload_time": {
      "$date": "2017-04-13T12:17:55.095Z"
    },
    "description_content": "It's been almost one year since I left from college. At the beginning of self challenging then became desperate deal with suspicions of my capability, the only thing on top of my mind now is: go back to college and continue to explore.\nMy story started from St.Joseph High School, where I met Thomas, my classmate and a close friend, also a decent team leader. We hanged out every weekend. At first the conversation was about personal interests and then we found out that we shared same interest on computer technologies such like video games, hardwares benchmarks, and write scripts. I gave him the story about what happened between Lockheed Martin and Boeing, a campaign of designing Joint Strike Fighter Program (JSF) since 1993. The winner received hundreds of millions dollars contract from the Pentagon and signed their name to the subsequent era of US best flight jet factory. The world most advanced flight jet F-35 almost lost the chance to demonstrate itself to the world back in 2000, when the debut flight took place on Florida's desert, F-35's opponent X-32 from Boeing has exact same performance and even better potential by Boeing's highly accurate computer technique (Lockheed Martin use human force design) and left a good impression to the analyzers in the pentagon, however, Boeing's first flight jet doesn't have the same advanced software and system to drive it, without enough time to debug and complete the critical system, a crash nearly destroyed the plane during it's final test elevator hover landing (vertical landing). This is one of the stories made me a fan of computer sciences and programing is such an indispensable business in today's world we living. Few weeks after, one day he came to me and said:\" Hey. I like you to see something I made. It's pretty cool! I call it Lehgo[1].\" What he did was a social network platform with advance server system structure, it was the time when Myspace lost its market territory and Facebook just started impacting teenagers, when I compare between Lehgo and Facebook the first impression is, it's amazingly fast! He asked me if I'm interesting in this project and join to his group and code with him, I couldn't say yes because I know nothing about web development programing, he simply replied me by 5 things, \"front-end design(UI), database, G-Wan, Nginx and server languages\", although it doesn't look like that much from the words, it did take my entire free time to figure out them and yet I'm still learning, also I joined his team after a year later during my high school senior year. So during the weekdays I'm just a high school student, and every weekends me and Thomas would sit together share the idea how to make Lehgo becomes better, for couple hours we would have pen and piece of paper in hand, drew down the better looking user interface that we both agreed and use twenty minutes turn them into code; next couple of hours we would go through every single function that what Lehgo needs to be improved or we want to add on, then spent rest of time checking reference, such like open source projects, structures efficiency benchmark, structures security and database protection, compatibility between major browsers. Sometimes straight of successes work made time flies, next time I looked up to the clock usually would be 4 or 5 in the morning, we went down to the basement find a couch to sleep (no place to sleep in his room because its full or computers and hardwares), or we could get stick into some malfunctions, kept trying until sunup but still ended up as fail and continued on next day, next week or maybe next month. Even though we only work at weekends, however, consistently 2 years of programing mean thousands lines of codes, countless practices and experiences, then I graduated from St.Joseph.\nAfter leaving my high school, Thomas chose not to attend college and fully committed to Lehgo. I went part-time work with him while waited for colleges' offer. During the summer, we finished building up our first own desktop Dev server quickly. Fortunately we also got some free replaced servers from high school to store data. Soon we had installed Nginx and launched Lehgo publicly, pushed it to some undergraduate St.Joseph's students and some computer teachers. In the first few weeks, we already had dozens of users from St.Joseph. Thomas told me this was an excellent start.\nMeanwhile, I went to a mid rank college for 2 years and finished an associate degree. Then I made a decision to take a semester off, first because there is not too much left for me even I stay in that college for 2 more years, I could do most things by my own with online resource at that time, second because, I want to keep enhancing Lehgo, from my own perspective, it has huge potential in education uses, (at that time Facebook was still struggling with privacy invasion and mess application censorship), if Lehgo could be the one use in between students and teachers or schools, for sharing open source educational materials, that will make it much more recognized and valuable, also that could be the main feature of it. I told Thomas about my idea, he turned me down by staying silent while he ensuring that his original plan comes true: sell to companies and charges them for advertisements. That was first time a disagreement and serious talk between me and Thomas, the argument is short and ended fast, main reason for him was he doesn't want to make his work for free, he has enough patience and faith that the opportunity will show up soon, for me, I thought although Lehgo is a beautiful work but still not good enough for commercial use, it lacks compatibility of development, if any company wants to use it as a matured social network tool, it has to have a larger team support behind, but at this moment, there were only 4 people knew the server structure, and most of us were spending part time coding; also, it's security was too easy to break too, one day I tried shutting down the website twice from my laptop, safety and privacy always are sensitive priority for all information holder to jeopardized, no one like to speak to someone that they don't trust . Even Thomas admits it, but he still insisted ran his plan, ever since that he was contacting me less and less. Today we haven't had communication for months.\nI had to move on because off school wasn't easy for anyone, at beginning I did feel more freedom and less pressure compared between make my own agenda and prepare exams in school, with not much difficulty I found myself a job as a technician work in a warfare by testing and fixing pre-owned monitors during the week, rest of time I take another job in frozen department in ShopRite of Edison, after work time are used to write some websites to get extra pay and at the weekends I was always trying work on Lehgo. I still couldn't forget my first project Oesllc.us[2], it’s for the warfare I have worked, today when I look back either the code or the appearance of it I can only see the ugliness, but I will never forget how interest I had dived in deep and how excite when I finished my first website. After that everytime I wrote a site made me more and more experienced and demonstrative, 6 months ago I build my own dev website server[3] for testing codes and storing files, all spendings were from my part-time job incomes and those websites that I wrote, also I got enough money remaining to pay my living costs, phone, gas, room rent etc…Up until now, I'm still try working on Lehgo when possible, whether or not Lehgo will get investors, doesn't attract me any more, I told Thomas, \"For now I'm happy that I can just programing.\" While everything is going the way it is for so long makes me feel that I ain't going any further, like fear of claustrophobia; sometimes I do thinking that it’s not things are not moving or maybe just because I can't move, without going through college. Those days out of school taught me how precious and important the college is, and the first step for me should be return to college to achieve a bachelor's degree or higher degrees. Rutgers is always the best place to pursue my goal, 2 years ago I didn't get the chance to get into. Yet I'm trying again. It's one of the best science school in New Jersey, top 50 computer sciences ranking major in the US, a public Ivy college and Jersey dream for me. Four and half years living in New Jersey out of total 5 years in US, I know how challenge to be a CS major student in Rutgers and the final certification is worth to achieve. And when I graduate from Rutgers, I want to go back talk to Thomas, at that time he might accept my idea and I'm still willing to keep optimizing Lehgo's security for commercial use, maybe each other of us step back a bit will find us the solution we wanted, like nick vujicic said, \"Get up or give up\", I will never be the one who give up first, like Julian Assange and Daniel Berg from best partner to life-time enemy[4]. I cannot wait to get away back to college to find out how much I can do and how much I can learn, and how much I can tell Thomas we missed in college.\n",
    "evaluation": {
      "word_count": 1626,
      "processed_language": "en",
      "personality": [
        {
          "trait_id": "big5_openness",
          "name": "Openness",
          "category": "personality",
          "percentile": 0.5522975200131851,
          "raw_score": 0.752849123769517,
          "children": [
            {
              "trait_id": "facet_adventurousness",
              "name": "Adventurousness",
              "category": "personality",
              "percentile": 0.5161637347931263,
              "raw_score": 0.5062590258356391
            },
            {
              "trait_id": "facet_artistic_interests",
              "name": "Artistic interests",
              "category": "personality",
              "percentile": 0.12062633068639717,
              "raw_score": 0.6060011616400403
            },
            {
              "trait_id": "facet_emotionality",
              "name": "Emotionality",
              "category": "personality",
              "percentile": 0.29492227630838797,
              "raw_score": 0.6262181896948247
            },
            {
              "trait_id": "facet_imagination",
              "name": "Imagination",
              "category": "personality",
              "percentile": 0.15894607882123835,
              "raw_score": 0.6852479978851714
            },
            {
              "trait_id": "facet_intellect",
              "name": "Intellect",
              "category": "personality",
              "percentile": 0.9665042946458604,
              "raw_score": 0.6920322986052752
            },
            {
              "trait_id": "facet_liberalism",
              "name": "Authority-challenging",
              "category": "personality",
              "percentile": 0.8367311956695751,
              "raw_score": 0.5656444505035565
            }
          ]
        },
        {
          "trait_id": "big5_conscientiousness",
          "name": "Conscientiousness",
          "category": "personality",
          "percentile": 0.5510682221911894,
          "raw_score": 0.6340378554488858,
          "children": [
            {
              "trait_id": "facet_achievement_striving",
              "name": "Achievement striving",
              "category": "personality",
              "percentile": 0.7390525462650308,
              "raw_score": 0.7223055268385898
            },
            {
              "trait_id": "facet_cautiousness",
              "name": "Cautiousness",
              "category": "personality",
              "percentile": 0.8990229554784297,
              "raw_score": 0.5730219578116389
            },
            {
              "trait_id": "facet_dutifulness",
              "name": "Dutifulness",
              "category": "personality",
              "percentile": 0.820629889468673,
              "raw_score": 0.6813761901906568
            },
            {
              "trait_id": "facet_orderliness",
              "name": "Orderliness",
              "category": "personality",
              "percentile": 0.06541415329694439,
              "raw_score": 0.44466701630997046
            },
            {
              "trait_id": "facet_self_discipline",
              "name": "Self-discipline",
              "category": "personality",
              "percentile": 0.4531182954108496,
              "raw_score": 0.5650425512050377
            },
            {
              "trait_id": "facet_self_efficacy",
              "name": "Self-efficacy",
              "category": "personality",
              "percentile": 0.8109439370295859,
              "raw_score": 0.7840962780624382
            }
          ]
        },
        {
          "trait_id": "big5_extraversion",
          "name": "Extraversion",
          "category": "personality",
          "percentile": 0.030005152462640905,
          "raw_score": 0.467081786638938,
          "children": [
            {
              "trait_id": "facet_activity_level",
              "name": "Activity level",
              "category": "personality",
              "percentile": 0.8727339069980018,
              "raw_score": 0.5986815964729706
            },
            {
              "trait_id": "facet_assertiveness",
              "name": "Assertiveness",
              "category": "personality",
              "percentile": 0.865885764768627,
              "raw_score": 0.6994055541016941
            },
            {
              "trait_id": "facet_cheerfulness",
              "name": "Cheerfulness",
              "category": "personality",
              "percentile": 0.10427341542709034,
              "raw_score": 0.575935313897747
            },
            {
              "trait_id": "facet_excitement_seeking",
              "name": "Excitement-seeking",
              "category": "personality",
              "percentile": 0.16164812238544646,
              "raw_score": 0.5617254552249878
            },
            {
              "trait_id": "facet_friendliness",
              "name": "Outgoing",
              "category": "personality",
              "percentile": 0.3355755957786323,
              "raw_score": 0.5391941646225894
            },
            {
              "trait_id": "facet_gregariousness",
              "name": "Gregariousness",
              "category": "personality",
              "percentile": 0.024925409538058163,
              "raw_score": 0.35251498519765645
            }
          ]
        },
        {
          "trait_id": "big5_agreeableness",
          "name": "Agreeableness",
          "category": "personality",
          "percentile": 0.019542849820731345,
          "raw_score": 0.6601735066868394,
          "children": [
            {
              "trait_id": "facet_altruism",
              "name": "Altruism",
              "category": "personality",
              "percentile": 0.5468490873591024,
              "raw_score": 0.7092186807789053
            },
            {
              "trait_id": "facet_cooperation",
              "name": "Cooperation",
              "category": "personality",
              "percentile": 0.6178977999823053,
              "raw_score": 0.5974612394447955
            },
            {
              "trait_id": "facet_modesty",
              "name": "Modesty",
              "category": "personality",
              "percentile": 0.3401980894935812,
              "raw_score": 0.426639943583589
            },
            {
              "trait_id": "facet_morality",
              "name": "Uncompromising",
              "category": "personality",
              "percentile": 0.381237050666486,
              "raw_score": 0.6115503008964502
            },
            {
              "trait_id": "facet_sympathy",
              "name": "Sympathy",
              "category": "personality",
              "percentile": 0.6591989659003856,
              "raw_score": 0.6791444203985977
            },
            {
              "trait_id": "facet_trust",
              "name": "Trust",
              "category": "personality",
              "percentile": 0.8103015892981089,
              "raw_score": 0.6220144821280328
            }
          ]
        },
        {
          "trait_id": "big5_neuroticism",
          "name": "Emotional range",
          "category": "personality",
          "percentile": 0.7587658118819365,
          "raw_score": 0.506957810887938,
          "children": [
            {
              "trait_id": "facet_anger",
              "name": "Fiery",
              "category": "personality",
              "percentile": 0.1887839520750979,
              "raw_score": 0.4874616111240886
            },
            {
              "trait_id": "facet_anxiety",
              "name": "Prone to worry",
              "category": "personality",
              "percentile": 0.4045991291485248,
              "raw_score": 0.5776449857130631
            },
            {
              "trait_id": "facet_depression",
              "name": "Melancholy",
              "category": "personality",
              "percentile": 0.698889095232168,
              "raw_score": 0.481451187067236
            },
            {
              "trait_id": "facet_immoderation",
              "name": "Immoderation",
              "category": "personality",
              "percentile": 0.19537082151186808,
              "raw_score": 0.4676049387799671
            },
            {
              "trait_id": "facet_self_consciousness",
              "name": "Self-consciousness",
              "category": "personality",
              "percentile": 0.7244730475451475,
              "raw_score": 0.578085280545813
            },
            {
              "trait_id": "facet_vulnerability",
              "name": "Susceptible to stress",
              "category": "personality",
              "percentile": 0.5232195950452181,
              "raw_score": 0.47133209837718976
            }
          ]
        }
      ],
      "needs": [
        {
          "trait_id": "need_challenge",
          "name": "Challenge",
          "category": "needs",
          "percentile": 0.5148773086662242,
          "raw_score": 0.7334571955782624
        },
        {
          "trait_id": "need_closeness",
          "name": "Closeness",
          "category": "needs",
          "percentile": 0.023245457869434327,
          "raw_score": 0.7049914851559292
        },
        {
          "trait_id": "need_curiosity",
          "name": "Curiosity",
          "category": "needs",
          "percentile": 0.5350764162521982,
          "raw_score": 0.8189672873898419
        },
        {
          "trait_id": "need_excitement",
          "name": "Excitement",
          "category": "needs",
          "percentile": 0.0989417247151676,
          "raw_score": 0.5829234366595557
        },
        {
          "trait_id": "need_harmony",
          "name": "Harmony",
          "category": "needs",
          "percentile": 0.072032934790626,
          "raw_score": 0.7588154883700402
        },
        {
          "trait_id": "need_ideal",
          "name": "Ideal",
          "category": "needs",
          "percentile": 0.35280456289968964,
          "raw_score": 0.6731026216611948
        },
        {
          "trait_id": "need_liberty",
          "name": "Liberty",
          "category": "needs",
          "percentile": 0.24061180240294322,
          "raw_score": 0.7101258398711601
        },
        {
          "trait_id": "need_love",
          "name": "Love",
          "category": "needs",
          "percentile": 0.07619388677404793,
          "raw_score": 0.6990406328838276
        },
        {
          "trait_id": "need_practicality",
          "name": "Practicality",
          "category": "needs",
          "percentile": 0.4296216943432499,
          "raw_score": 0.7239418381024488
        },
        {
          "trait_id": "need_self_expression",
          "name": "Self-expression",
          "category": "needs",
          "percentile": 0.02276721959331851,
          "raw_score": 0.6060578515738493
        },
        {
          "trait_id": "need_stability",
          "name": "Stability",
          "category": "needs",
          "percentile": 0.34924521839263867,
          "raw_score": 0.7221128038802916
        },
        {
          "trait_id": "need_structure",
          "name": "Structure",
          "category": "needs",
          "percentile": 0.8744949491752068,
          "raw_score": 0.7271830399648122
        }
      ],
      "values": [
        {
          "trait_id": "value_conservation",
          "name": "Conservation",
          "category": "values",
          "percentile": 0.12767942807444277,
          "raw_score": 0.6142084362616994
        },
        {
          "trait_id": "value_openness_to_change",
          "name": "Openness to change",
          "category": "values",
          "percentile": 0.1289462494197981,
          "raw_score": 0.7406404820007922
        },
        {
          "trait_id": "value_hedonism",
          "name": "Hedonism",
          "category": "values",
          "percentile": 0.013071552350127913,
          "raw_score": 0.5960731570507095
        },
        {
          "trait_id": "value_self_enhancement",
          "name": "Self-enhancement",
          "category": "values",
          "percentile": 0.059144715741604625,
          "raw_score": 0.6378025073591268
        },
        {
          "trait_id": "value_self_transcendence",
          "name": "Self-transcendence",
          "category": "values",
          "percentile": 0.28941855994057064,
          "raw_score": 0.823917713599262
        }
      ]
    }
  },
  "interest_manual": [
    {
      "term": "AI",
      "value": 15.964336999999995
    }
  ],
  "interest": [
    {
      "term": "software engineer",
      "value": 2.412286
    },
    {
      "term": "worst parts",
      "value": 1.926264
    },
    {
      "value": 0.398557,
      "term": "Middle school"
    },
    {
      "value": 0.42736,
      "term": "High School"
    },
    {
      "value": 0.446579,
      "term": "Secondary school"
    },
    {
      "value": 0.456079,
      "term": "Part-time"
    },
    {
      "value": 0.46175,
      "term": "Secondary education"
    },
    {
      "value": 0.501936,
      "term": "Full-time"
    },
    {
      "value": 0.50516,
      "term": "Twelfth grade"
    },
    {
      "value": 0.64096,
      "term": "College"
    },
    {
      "value": 0.644119,
      "term": "F-35 Lightning II"
    },
    {
      "value": 0.976978,
      "term": "High school"
    },
    {
      "value": 0.277868,
      "term": "Julian Assange"
    },
    {
      "value": 0.282915,
      "term": "Florida"
    },
    {
      "value": 0.290163,
      "term": "nick vujicic"
    },
    {
      "value": 0.29446,
      "term": "Myspace"
    },
    {
      "value": 0.307868,
      "term": "Ivy college"
    },
    {
      "value": 0.316109,
      "term": "team leader"
    },
    {
      "value": 0.322921,
      "term": "Pentagon"
    },
    {
      "value": 0.73889,
      "term": "Lockheed Martin"
    },
    {
      "value": 0.330649,
      "term": "New Jersey"
    },
    {
      "value": 0.333324,
      "term": "US"
    },
    {
      "value": 0.359269,
      "term": "Rutgers"
    },
    {
      "value": 0.39626,
      "term": "Boeing"
    },
    {
      "value": 0.410717,
      "term": "Facebook"
    },
    {
      "value": 0.756361,
      "term": "test elevator hover"
    },
    {
      "value": 0.757287,
      "term": "desktop Dev server"
    },
    {
      "value": 0.759795,
      "term": "human force design"
    },
    {
      "value": 0.76209,
      "term": "public Ivy college"
    },
    {
      "value": 0.762388,
      "term": "open source"
    },
    {
      "value": 0.762664,
      "term": "mid rank college"
    },
    {
      "value": 0.762944,
      "term": "social network"
    },
    {
      "value": 0.763679,
      "term": "best science school"
    },
    {
      "value": 0.765295,
      "term": "best flight jet"
    },
    {
      "value": 1.6515279999999999,
      "term": "Thomas"
    },
    {
      "value": 0.772081,
      "term": "decent team leader"
    },
    {
      "value": 0.772542,
      "term": "flight jet F-35"
    },
    {
      "value": 0.78117,
      "term": "entire free time"
    },
    {
      "value": 0.790887,
      "term": "web development programing"
    },
    {
      "value": 0.792249,
      "term": "time"
    },
    {
      "value": 2.174311,
      "term": "Lehgo"
    },
    {
      "value": 0.806832,
      "term": "flight jet"
    },
    {
      "value": 1.2522199999999999,
      "term": "St.Joseph High School"
    },
    {
      "value": 0.945776,
      "term": "high school"
    },
    {
      "term": "Mechanical engineering",
      "value": 0.864902
    },
    {
      "term": "department contact infomation",
      "value": 0.953697
    },
    {
      "value": 2.2428,
      "term": "Pennsylvania State University"
    },
    {
      "value": 2.395911,
      "term": "Big Ten Conference"
    },
    {
      "value": 2.721603,
      "term": "Pennsylvania"
    },
    {
      "value": 0.99,
      "term": "penn state"
    },
    {
      "value": 2.3433509999999997,
      "term": "state"
    },
    {
      "value": 2.778045,
      "term": "soup"
    },
    {
      "term": "su",
      "value": 4.753225
    },
    {
      "value": 1.175808,
      "term": "study"
    },
    {
      "term": "Software",
      "value": 2.0784
    },
    {
      "term": "software engineering",
      "value": 2.91501
    },
    {
      "term": "Application software",
      "value": 1.733492
    },
    {
      "term": "Software engineering",
      "value": 6.349506
    },
    {
      "term": "software engineering program",
      "value": 1.874404
    },
    {
      "term": "Computer science",
      "value": 1.60832
    },
    {
      "term": "Computer",
      "value": 3.885252
    },
    {
      "term": "Computer graphics",
      "value": 1.69792
    },
    {
      "term": "comp sci",
      "value": 1.838826
    },
    {
      "term": "behrend",
      "value": 7.67489
    },
    {
      "term": "help",
      "value": 2.364272
    },
    {
      "term": "financial aid",
      "value": 3.625804
    },
    {
      "term": "Defunct companies based in Connecticut",
      "value": 1.658996
    },
    {
      "term": "2006 albums",
      "value": 1.689956
    },
    {
      "term": "advisor",
      "value": 0.66
    },
    {
      "term": "best advisor",
      "value": 1.857594
    },
    {
      "term": "credits",
      "value": 11.887551
    },
    {
      "term": "engineering",
      "value": 15.964336999999995
    },
    {
      "term": "general education credits",
      "value": 5.964396
    }
  ],
  "ask_history": [
    {
      "question_body": "How many general education credits i have to take for engineering",
      "_id": {
        "$oid": "58ef4cacd1ef61ea5245782b"
      },
      "question_keyword": [
        
      ],
      "question_taxonomy": [
        
      ],
      "question_entitie": [
        
      ],
      "question_concept": [
        
      ],
      "ask_count": 1,
      "ask_time": {
        "$date": "2017-04-13T10:02:20.343Z"
      },
      "favorite": false,
      "answer_body": "<p class=\"answer-body\">Students may, with the permission of their adviser and dean's representative: <br> <\/p><ul> <li> Substitute a 200- to 499-level course in an area of General Education for a course found on the General Education list. For example, a student may take a 400-level course in history and use it to meet the General Education requirement satisfied by a comparable lower-level history course. <\/li> <li> Substitute a foreign language at the twelfth credit level of proficiency, as measured by the Penn State foreign language offerings, for 3 credits in any of the categories of General Education. Baccalaureate degree students may substitute study in a foreign/second language at the twelfth credit level of proficiency or higher for any three credits in any of the categories of general education only if those three credits are in language study beyond their degree requirements. * <\/li> <li> Substitute a third course in one of the Knowledge Domains areas of Arts, Humanities, or Social and Behavioral Sciences for a second course in one of the other areas. For example, a student might take 3 courses in the Arts, two courses in the Humanities, and only one course in the Social and Behavioral Sciences. This substitution is often referred to as the 9-6-3 sequence, representing the 9 credits, 6 credits, and 3 credits completed in place of the specified 6-6-6. * <\/li> <li> Meet the United States Cultures (US) and International Cultures (IL) requirement through completion of an experiential learning program or practicum (one-semester or year long) approved by their College Dean's Office. Approved Penn State Education Abroad Programs may be used to satisfy the International Cultures (IL) requirement. <\/li> <li> Meet First-Year Engagement Program requirements through completion of a First-Year Experience offered by any unit of the University. Thus, a student who successfully completes a First-Year Engagement Program in one college or campus, prior to transferring to another college or campus, will not be required to complete another First-Year Experience. However, since there are various modes of offering First-Year Seminars throughout the University, students transferring to a new college may find that a required course that is also a First-Year Seminar must still be taken. <\/li> <\/ul> <div><span class=\"read-more btn btn-secondary\">Read More<\/span><div class=\"answer-body hide\"> * The use of these two substitutions (No. 2 and No. 3 above), either alone or in combination, may not lead to the complete elimination of any area in the skills or knowledge domains categories in the student's general education program. <br> <\/div><\/div><p><\/p>"
    },
    {
      "question_body": "Who is meng su?",
      "_id": {
        "$oid": "58ef5196cd2b5901530303ba"
      },
      "question_keyword": [
        
      ],
      "question_taxonomy": [
        
      ],
      "question_entitie": [
        
      ],
      "question_concept": [
        
      ],
      "ask_count": 1,
      "ask_time": {
        "$date": "2017-04-13T10:23:18.556Z"
      },
      "favorite": true,
      "answer_body": "<p class=\"answer-body\">The following <a target=\"_blank\" href=\"https://psbehrend.psu.edu/school-of-engineering/faculty-staff-directory/computer-science-and-software-engineering-faculty\">professors<\/a> currently teach both Software Engineering and Computer Science: Meng Su, Adriano Cavalcanti, Ron DelPorto, George Dudas, Xiaocong Fan, Melanie Ford, Jalaa Hoblos, Naseem Ibrahim, Wen Li Wang, Zhifeng Xiao, Guang Zhang, and Richard Zhao. <\/p>"
    },
    {
      "question_body": "Does penn state have soup?",
      "_id": {
        "$oid": "58ef5284cd2b5901530303bf"
      },
      "question_keyword": [
        
      ],
      "question_taxonomy": [
        
      ],
      "question_entitie": [
        
      ],
      "question_concept": [
        
      ],
      "ask_count": 1,
      "ask_time": {
        "$date": "2017-04-13T10:27:16.945Z"
      },
      "favorite": false
    },
    {
      "question_body": "What is engineering department contact infomation?",
      "_id": {
        "$oid": "58ef5392cd2b5901530303c2"
      },
      "question_keyword": [
        
      ],
      "question_taxonomy": [
        
      ],
      "question_entitie": [
        
      ],
      "question_concept": [
        
      ],
      "ask_count": 1,
      "ask_time": {
        "$date": "2017-04-13T10:31:46.108Z"
      },
      "favorite": true,
      "answer_body": "<p class=\"answer-body\">There are a lot of <a target=\"_blank\" href=\"https://psbehrend.psu.edu/school-of-engineering/faculty-staff-directory\">professors<\/a> in the engineering department, so I’ll go by majors:<br> Computer Science and Software Engineering:<br> Meng Su, Adriano Cavalcanti, Ron DelPorto, George Dudas, Xiaocong Fan, Melanie Ford, Jalaa Hoblos, Naseem Ibrahim, Wen Li Wang, Zhifeng Xiao, Guang Zhang, and Richard Zhao.<br> Computer Engineering and Electrical Engineering: <br> Thomas Hemminger, Kyeiwaa Asare-Yeboah, Terak Elarabi, Ralph Ford, Sudarshan Nelatury, Robin Panda, Mohammad Rasouli, and George Walters<br> Electrical and Computer Engineering Technology:<br> David Loker, Young-Man Kim, Roger Kuntz, Xinwei Niu, and Stephen Strom<br> Mechanical Engineering and Industrial Engineering:<br> William Lasher, Russ Warley, Faisal Aqlan, Omar Ashour, David Beevers, Amir Danesh-Yazdi, Charlotte de Vries, Adam Hollinger, Yuan-Han Huang, Jill Johnson, Amir Khalilollahi, Dean Lewis, Paul Lynch, Chetan Nikhare, Dipo Onipede, John Roth, Shraddha Sangelkar, Hamid Sanei, Barukyah Shaparenko, Yustianto Tjiptowidjojo, Yi (Elisa) Wu, and Jun Zhou.<br> Mechanical Engineering Technology:<br> Edward Evans, Azize Akcayoglu, Robert Edwards, Richard Englund, David Johnson, Phil Jones, Michael Lobaugh, Fred Niterright, Ihab Ragai, Nancy Study, Liyong Sun, Shannon Sweeney, and Alex Wouden.<br> Plastics Engineering Technology:<br> Jonathan Meckley, Greg Dillon, Anne Gohn, Bradley Johnson, Lucy Lenhardt, Alicyn Rhoades, Gary Smith, Jason Williams, and Brian Young.<br> <\/p>"
    }
  ]
}
